I've had this issue a few times. In the Terraform configuration the enrolment is configured with `acknowledge_pre_verification_warnings = true`. In the plan it shows that it will create an enrolment with `acknowledge_pre_verification_warnings = true`.

<img width="1130" height="98" alt="Image" src="https://github.com/user-attachments/assets/fd574216-401d-4754-819d-4c4d404b9ac9" />

Then the enrolment creation fails with the error:

```shell
│ Error: fetching pre-verification-warnings: API error: 
│ {
│       "type": "[https://host.luna.akamaiapis.net/cps/v2/error-types/not-found"](https://host.luna.akamaiapis.net/cps/v2/error-types/not-found%22),
│       "title": "Not Found",
│       "detail": "",
│       "instance": "[https://host.luna.akamaiapis.net/cps/v2/error-types/not-found?id=…](https://host.luna.akamaiapis.net/cps/v2/error-types/not-found?id=id),
│       "statusCode": 404
│ }
│ 
│   with module.api.akamai_cps_dv_enrollment.this[0],
│   on ../../../modules/api/certificate.tf line 1, in resource "akamai_cps_dv_enrollment" "this":
│    1: resource "akamai_cps_dv_enrollment" "this" {
```

Then I run a plan and it says the enrolment needs to be replaced

```shell
  # module.api.akamai_cps_dv_enrollment.this[0] is tainted, so must be replaced
-/+ resource "akamai_cps_dv_enrollment" "this" {
      ~ certificate_type                      = "san" -> (known after apply)
      ~ dns_challenges                        = [] -> (known after apply)
      ~ http_challenges                       = [] -> (known after apply)
      ~ id                                    = "123456" -> (known after apply)
      ~ registration_authority                = "lets-encrypt" -> (known after apply)
      - sans                                  = [] -> null
      ~ validation_type                       = "dv" -> (known after apply)
        # (8 unchanged attributes hidden)
 
        # (5 unchanged blocks hidden)
    }
```

So I removed from the state `terraform state rm "module.api.akamai_cps_dv_enrollment.this[0]"`
and then imported it again `terraform import "module.api.akamai_cps_dv_enrollment.this[0]" 123456,ctr_P-12I3C4D`

Then the plan show it as having `acknowledge_pre_verification_warnings = false`.

```shell
  # module.api.akamai_cps_dv_enrollment.this[0] will be updated in-place
  ~ resource "akamai_cps_dv_enrollment" "this" {
      ~ acknowledge_pre_verification_warnings = false -> true
        id                                    = "123456"
        # (13 unchanged attributes hidden)
 
        # (5 unchanged blocks hidden)
    }
```